Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Set default parameters for this route and allow partial matching to simplify application embedding, takes the same arguments as L</"to">.
ja: Set default parameters for this route and allow partial matching to simplify application embedding, takes the same arguments as [[/"to"]].

source: Sets up the default controller and emits the L</"around_dispatch"> hook for every request.
ja: Sets up the default controller and emits the [[/"around_dispatch"]] hook for every request.

source: Share code with L<Mojolicious/"hook">.
ja: Share code with [[Mojolicious/"hook"]].

source: Shortcut for passing values between L</"steps">.
ja: Shortcut for passing values between [[/"steps"]].

source: Signed cookie based session manager, defaults to a L<Mojolicious::Sessions> object.
ja: Signed cookie based session manager, defaults to a [[Mojolicious::Sessions]] object.

source: Similar to L</"cookie">, but returns all message cookies sharing the same name as an array reference.
ja: Similar to [[/"cookie"]], but returns all message cookies sharing the same name as an array reference.

source: Similar to L</"cookie">, but returns all request cookie values sharing the same name as an array reference.
ja: Similar to [[/"cookie"]], but returns all request cookie values sharing the same name as an array reference.

source: Similar to L</"header">, but returns all headers sharing the same name as an array reference.
ja: Similar to [[/"header"]], but returns all headers sharing the same name as an array reference.

source: Similar to L</"param">, but returns all values sharing the same name as an array reference.
ja: Similar to [[/"param"]], but returns all values sharing the same name as an array reference.

source: Similar to L</"signed_cookie">, but returns all signed request cookie values sharing the same name as an array reference.
ja: Similar to [[/"signed_cookie"]], but returns all signed request cookie values sharing the same name as an array reference.

source: Similar to L</"upload">, but returns all file uploads sharing the same name as an array reference.
ja: Similar to [[/"upload"]], but returns all file uploads sharing the same name as an array reference.

source: Similar to plugins, instead of the L</"helper"> function you just use the method L<Mojolicious/"helper">.
ja: Similar to plugins, instead of the [[/"helper"]] function you just use the method [[Mojolicious/"helper"]].

source: Similar to templates, but with only a single file extension and optional Base64 encoding, static files can be inlined in the C<DATA> section and are served automatically.
ja: テンプレートに似て、静的ファイルはC<DATA>セクションの中にインラインで記述することができ、自動的にサーブされます。ただし、使える拡張子が1種類に限られるのと、Base64エンコーディングが使える点が異なります。

source: Simple and fun introduction to the L<Mojolicious> router.
ja: Simple and fun introduction to the [[Mojolicious]] router.

source: Since L<Mojo::UserAgent> is also based on the L<Mojo::IOLoop> event loop, it won't block the built-in web servers when used non-blocking, even for high latency backend web services.
ja: Since [[Mojo::UserAgent]] is also based on the [[Mojo::IOLoop]] event loop, it won't block the built-in web servers when used non-blocking, even for high latency backend web services.

source: Since all built-in web servers are based on the L<Mojo::IOLoop> event loop, they scale best with non-blocking operations.
ja: Since all built-in web servers are based on the [[Mojo::IOLoop]] event loop, they scale best with non-blocking operations.

source: Since full L<Mojolicious> applications can use nested routes they have no need for C<group> blocks.
ja: Since full [[Mojolicious]] applications can use nested routes they have no need for C<group> blocks.

source: Slurp or replace L</"content">.
ja: Slurp or replace [[/"content"]].

source: So L<Mojo::Promise/"wait"> can stop the event loop automatically if it had to be started at all in the first place.
ja: So [[Mojo::Promise/"wait"]] can stop the event loop automatically if it had to be started at all in the first place.

source: So if your contribution is not a simple bug fix, it is B<strongly recommended> that you discuss it in advance on the L<mailing list|http://groups.google.com/group/mojolicious> or the official IRC channel C<#mojo> on C<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>), to avoid unnecessary work and to increase its chances of getting accepted.
ja: So if your contribution is not a simple bug fix, it is B<strongly recommended> that you discuss it in advance on the [[mailing list|http://groups.google.com/group/mojolicious]] or the official IRC channel C<#mojo> on C<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>), to avoid unnecessary work and to increase its chances of getting accepted.

source: So you cannot currently use route placeholders in routes leading to embedded applications, since that would cause problems with L<Mojolicious::Controller/"url_for">.
ja: So you cannot currently use route placeholders in routes leading to embedded applications, since that would cause problems with [[Mojolicious::Controller/"url_for"]].

source: Some modules, like L<Mojo::Base> and L<Mojolicious::Lite>, will enable them for you automatically, whenever they are used.
ja: Some modules, like [[Mojo::Base]] and [[Mojolicious::Lite]], will enable them for you automatically, whenever they are used.

source: Some of the more advanced features, such as L<subprocesses|Mojo::IOLoop/"subprocess"> and the L<Hypnotoad|Mojo::Server::Hypnotoad> web server, will also require the use of the L<Windows Subsystem for Linux|https://msdn.microsoft.com/commandline/wsl/>.
ja: Some of the more advanced features, such as [[subprocesses|Mojo::IOLoop/"subprocess"]] and the [[Hypnotoad|Mojo::Server::Hypnotoad]] web server, will also require the use of the [[Windows Subsystem for Linux|https://msdn.microsoft.com/commandline/wsl/]].

source: Some of the most commonly used tools are L<Mojo::UserAgent>, L<Mojo::DOM>, L<Mojo::JSON>, L<Mojo::Server::Daemon>, L<Mojo::Server::Prefork>, L<Mojo::IOLoop> and L<Mojo::Template>.
ja: このうちもっともよく使われているツールには以下があります。 [[Mojo::UserAgent]], [[Mojo::DOM]], [[Mojo::JSON]], [[Mojo::Server::Daemon]], [[Mojo::Server::Prefork]], [[Mojo::IOLoop]] and [[Mojo::Template]]

source: Some of the work on this distribution has been sponsored by L<The Perl Foundation|http://www.perlfoundation.org>.
ja: Some of the work on this distribution has been sponsored by [[The Perl Foundation|http://www.perlfoundation.org]].

source: Some parts of the documentation only use the L<Mojolicious::Lite> micro web framework for examples, but that's merely a convenience for the reader.
ja: Some parts of the documentation only use the [[Mojolicious::Lite]] micro web framework for examples, but that's merely a convenience for the reader.

source: Sometimes you might want to use the rendered result directly instead of generating a response, for example, to send emails, this can be done with L<Mojolicious::Controller/"render_to_string">.
ja: Sometimes you might want to use the rendered result directly instead of generating a response, for example, to send emails, this can be done with [[Mojolicious::Controller/"render_to_string"]].

source: Standard route placeholders will not match the C<.> character, however L<Mojolicious> routes automatically take file extensions like C<.html>, remove the leading C<.>, and store the result in the C<format> stash value.
ja: Standard route placeholders will not match the C<.> character, however [[Mojolicious]] routes automatically take file extensions like C<.html>, remove the leading C<.>, and store the result in the C<format> stash value.

source: Start L</"ioloop"> and stop it again once the promise has been fulfilled or rejected, does nothing when L</"ioloop"> is already running.
ja: Start [[/"ioloop"]] and stop it again once the promise has been fulfilled or rejected, does nothing when [[/"ioloop"]] is already running.

source: Start or resume accepting connections through L</"ioloop">.
ja: Start or resume accepting connections through [[/"ioloop"]].

source: Start the event loop, this will block until L</"stop"> is called.
ja: Start the event loop, this will block until [[/"stop"]] is called.

source: Start watching for I/O and timer events, this will block until L</"stop"> is called or no events are being watched anymore.
ja: Start watching for I/O and timer events, this will block until [[/"stop"]] is called or no events are being watched anymore.

source: Start watching for I/O and timer events, this will block until L</"stop"> is called.
ja: Start watching for I/O and timer events, this will block until [[/"stop"]] is called.

source: Starting a L<Mojolicious::Lite> prototype from scratch and growing it into a well-structured L<Mojolicious> application.
ja: Starting a [[Mojolicious::Lite]] prototype from scratch and growing it into a well-structured [[Mojolicious]] application.

source: Static files are automatically served from the C<public> directories of the application, which can be customized with L<Mojolicious::Static/"paths">, or one of the C<DATA> sections from L<Mojolicious::Static/"classes">.
ja: Static files are automatically served from the C<public> directories of the application, which can be customized with [[Mojolicious::Static/"paths"]], or one of the C<DATA> sections from [[Mojolicious::Static/"classes">.

source: Steal L</"handle"> and prevent it from getting closed automatically.
ja: Steal [[/"handle"]] and prevent it from getting closed automatically.

source: Stop accepting connections through L</"ioloop">.
ja: Stop accepting connections through [[/"ioloop"]].

source: Stop the event loop, this will not interrupt any existing connections and the event loop can be restarted by running L</"start"> again.
ja: Stop the event loop, this will not interrupt any existing connections and the event loop can be restarted by running [[/"start"]] again.

source: String value length or size of L<Mojo::Upload> object in bytes needs to be between these two values.
ja: String value length or size of [[Mojo::Upload]] object in bytes needs to be between these two values.

source: Subscribe to L</"error"> event.
ja: Subscribe to [[/"error"]] event.

source: Subscribe to events of L</"tx">, which is usually a L<Mojo::Transaction::HTTP> or L<Mojo::Transaction::WebSocket> object.
ja: Subscribe to events of [[/"tx"]], which is usually a [[Mojo::Transaction::HTTP]] or [[Mojo::Transaction::WebSocket]] object.

source: Support for compound selectors was added as part of L<Selectors Level 4|http://dev.w3.org/csswg/selectors-4>, which is still a work in progress.
ja: Support for compound selectors was added as part of [[Selectors Level 4|http://dev.w3.org/csswg/selectors-4]], which is still a work in progress.

source: Take a look at our excellent documentation in L<Mojolicious::Guides>!
ja: Take a look at our excellent documentation in [[Mojolicious::Guides]]!

source: Template blocks can be used like normal Perl functions and are always delimited by the C<begin> and C<end> keywords, they are the foundation for many helpers.
ja: テンプレートブロックは通常のPerl関数のように利用でき、常にC<begin>とC<end>というキーワードで区切ります。これは多くのヘルパーの基盤になっています。

source: Templates can have layouts too, you just select one with the helper L<Mojolicious::Plugin::DefaultHelpers/"layout"> and place the result of the current template with the helper L<Mojolicious::Plugin::DefaultHelpers/"content">.
ja: テンプレートにはレイアウトを持たせることができます。レイアウトは[[Mojolicious::Plugin::DefaultHelpers]]のC<layout>ヘルパーを使って選択することができ、[[Mojolicious::Plugin::DefaultHelpers]]のC<content>ヘルパーを使って現在のテンプレートの結果を入れることができます。

source: Templates stored in files are expected to be C<UTF-8> by default, but that can be easily changed with L<Mojolicious::Renderer/"encoding">.
ja: Templates stored in files are expected to be C<UTF-8> by default, but that can be easily changed with [[Mojolicious::Renderer/"encoding"]].

source: Temporarily spawn up to this number of additional workers if there is a need, defaults to the value of L<Mojo::Server::Prefork/"spare">.
ja: Temporarily spawn up to this number of additional workers if there is a need, defaults to the value of [[Mojo::Server::Prefork/"spare"]].

source: Temporary directory used to generate L</"path">, defaults to the value of the C<MOJO_TMPDIR> environment variable or auto-detection.
ja: Temporary directory used to generate [[/"path"]], defaults to the value of the C<MOJO_TMPDIR> environment variable or auto-detection.

source: Testing WebSocket servers does not get any simpler than with L<Test::Mojo>.
ja: Testing WebSocket servers does not get any simpler than with [[Test::Mojo]].

source: Testing a Mojolicious application using L<Test::Mojo> will never conflict with running applications, including the application you're testing.
ja: Testing a Mojolicious application using [[Test::Mojo]] will never conflict with running applications, including the application you're testing.

source: Testing your application is as easy as creating a C<t> directory and filling it with normal Perl tests like C<t/basic.t>, which can be a lot of fun thanks to L<Test::Mojo>.
ja: アプリケーションをテストするのはとても簡単です。C<t>ディレクトリを作成して 普通のPerlの単体テストを書くだけです。[[Test::Mojo]]のおかげで、 とても楽しいです。

source: Thanks to the command L<Mojolicious::Command::get> that is about to change.
ja: Thanks to the command [[Mojolicious::Command::get]] that is about to change.

source: Thanks to the command L<Mojolicious::Command::eval> you can do just that, the application object itself can be accessed via C<app>.
ja: Thanks to the command [[Mojolicious::Command::eval]] you can do just that, the application object itself can be accessed via C<app>.

source: That means you can upgrade L<Mojolicious>, Perl or even system libraries at runtime without ever stopping the server or losing a single incoming connection, just by running the command above again.
ja: That means you can upgrade [[Mojolicious]], Perl or even system libraries at runtime without ever stopping the server or losing a single incoming connection, just by running the command above again.

source: That's why L<Mojolicious> comes with the possibly fastest pure-Perl implementation L<Mojo::JSON> built right in, which is accessible through L<Mojo::Message/"json">.
ja: That's why [[Mojolicious]] comes with the possibly fastest pure-Perl implementation [[Mojo::JSON]] built right in, which is accessible through [[Mojo::Message/"json"]].

source: The C<controller> value gets converted from C<snake_case> to C<CamelCase> using L<Mojo::Util/"camelize"> and appended to one or more namespaces, defaulting to a controller namespace based on the application class (C<MyApp::Controller>), as well as the bare application class (C<MyApp>), and these namespaces are searched in that order.
ja: The C<controller> value gets converted from C<snake_case> to C<CamelCase> using [[Mojo::Util/"camelize"]] and appended to one or more namespaces, defaulting to a controller namespace based on the application class (C<MyApp::Controller>), as well as the bare application class (C<MyApp>), and these namespaces are searched in that order.

source: The arguments are then combined in the same order L</"begin"> was called, and passed together to the next step.
ja: The arguments are then combined in the same order [[/"begin"]] was called, and passed together to the next step.

source: The built-in HTML/XML parser L<Mojo::DOM> is accessible through L<Mojo::Message/"dom"> and supports all CSS selectors that make sense for a standalone parser, it can be a very powerful tool especially for testing web application.
ja: The built-in HTML/XML parser [[Mojo::DOM]] is accessible through [[Mojo::Message/"dom"]] and supports all CSS selectors that make sense for a standalone parser, it can be a very powerful tool especially for testing web application.

source: The default name is based on the value of L<Mojolicious/"moniker"> (C<myapp>), appended with a C<.conf> extension (C<myapp.conf>).
ja: The default name is based on the value of [[Mojolicious/"moniker"]] (C<myapp>), appended with a C<.conf> extension (C<myapp.conf>).

source: The level will default to either the C<MOJO_LOG_LEVEL> environment variable, C<debug> if the L</mode> is C<development>, or C<info> otherwise.
ja: The level will default to either the C<MOJO_LOG_LEVEL> environment variable, C<debug> if the [[/mode]] is C<development]], or C<info> otherwise.

source: The C<*_ok> HTTP request assertion methods accept the same arguments as their corresponding L<Mojo::UserAgent> methods (except for the callback argument).
ja: The C<*_ok> HTTP request assertion methods accept the same arguments as their corresponding [[Mojo::UserAgent]] methods (except for the callback argument).

source: The C<Hello World> example above can get even a little bit shorter in an L<ojo> one-liner.
ja: The C<Hello World> example above can get even a little bit shorter in an [[ojo]] one-liner.

source: The C<LIBEV_FLAGS> environment variable should also be used to select the best possible L<EV> backend, which usually defaults to the not very scalable C<select>.
ja: The C<LIBEV_FLAGS> environment variable should also be used to select the best possible [[EV]] backend, which usually defaults to the not very scalable C<select>.

source: The C<MOJO_REVERSE_PROXY> environment variable can be used to enable proxy support, this allows L<Mojolicious> to automatically pick up the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers.
ja: The C<MOJO_REVERSE_PROXY> environment variable can be used to enable proxy support, this allows [[Mojolicious]] to automatically pick up the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers.

source: The C<controller> is always converted from C<snake_case> to C<CamelCase> with L<Mojo::Util/"camelize">, and then appended to this C<namespace>.
ja: The C<controller> is always converted from C<snake_case> to C<CamelCase> with [[Mojo::Util/"camelize"]], and then appended to this C<namespace>.

source: The C<controller> value gets converted from C<CamelCase> to C<snake_case> using L<Mojo::Util/"decamelize"> and C<-> characters replaced with C</>.
ja: The C<controller> value gets converted from C<CamelCase> to C<snake_case> using [[Mojo::Util/"decamelize"> and C<-]] characters replaced with C</>.

source: The C<file> value should contain the path to the file you want to upload or an asset object, like L<Mojo::Asset::File> or L<Mojo::Asset::Memory>.
ja: The C<file> value should contain the path to the file you want to upload or an asset object, like [[Mojo::Asset::File]] or [[Mojo::Asset::Memory]].

source: The C<form> content generator (see L<Mojo::UserAgent::Transactor>) will generate a query string for C<GET> requests and C<application/x-www-form-urlencoded> or C<multipart/form-data> for POST requests.
ja: The C<form> content generator (see [[Mojo::UserAgent::Transactor>) will generate a query string for C<GET> requests and C<application/x-www-form-urlencoded> or C<multipart/form-data> for POST requests.

source: The C<json> content generator uses L<Mojo::JSON> for encoding and sets the content type to C<application/json>.
ja: The C<json> content generator uses [[Mojo::JSON]] for encoding and sets the content type to C<application/json>.

source: The C<json> stash value allows you to pass Perl data structures to the renderer which get directly encoded to JSON with L<Mojo::JSON>.
ja: The C<json> stash value allows you to pass Perl data structures to the renderer which get directly encoded to JSON with [[Mojo::JSON]].

source: The L</"TUTORIAL"> everyone starts with, the L</"GUIDES"> that explain all major features in detail, and the class L</"REFERENCE"> listing all available APIs.
ja: The [[/"TUTORIAL"]] everyone starts with, the [[/"GUIDES"]] that explain all major features in detail, and the class [[/"REFERENCE"]] listing all available APIs.

source: The L<Mojo::DOM> parser uses the CSS selector syntax described in L<Mojo::DOM::CSS>, allowing us to test for values in HTML and XML documents without resorting to typically verbose and inflexible DOM traversal methods.
ja: The [[Mojo::DOM]] parser uses the CSS selector syntax described in [[Mojo::DOM::CSS]], allowing us to test for values in HTML and XML documents without resorting to typically verbose and inflexible DOM traversal methods.

source: The L<Mojo::Server::Daemon> process can be controlled at runtime with the following signals.
ja: The [[Mojo::Server::Daemon]] process can be controlled at runtime with the following signals.

source: The L<Mojo::Server::Hypnotoad> manager process can be controlled at runtime with the following signals.
ja: The [[Mojo::Server::Hypnotoad]] manager process can be controlled at runtime with the following signals.

source: The L<Mojo::Server::Morbo> process can be controlled at runtime with the following signals.
ja: The [[Mojo::Server::Morbo]] process can be controlled at runtime with the following signals.

source: The L<Mojo::Server::Prefork> manager process can be controlled at runtime with the following signals.
ja: The [[Mojo::Server::Prefork]] manager process can be controlled at runtime with the following signals.

source: The L<Mojo::UserAgent> object in L<Test::Mojo> can handle HTTP redirections internally to whatever level you need.
ja: The [[Mojo::UserAgent]] object in [[Test::Mojo]] can handle HTTP redirections internally to whatever level you need.

source: The L<Mojo::UserAgent> object in L<Test::Mojo> will know where the application is running and make requests to it.
ja: The [[Mojo::UserAgent]] object in [[Test::Mojo]] will know where the application is running and make requests to it.

source: The L<Mojolicious::Controller/"stash"> is used to pass data to templates, which can be inlined in the C<DATA> section.
ja: [[Mojolicious::Controller]] のC<stash>はデータをテンプレートに渡すために利用します。

source: The L<Mojolicious::Routes> object this route is a descendant of.
ja: The [[Mojolicious::Routes]] object this route is a descendant of.

source: The L<Mojolicious> core team believes that there is a lot of value in the entire toolkit being a unified project.
ja: The [[Mojolicious]] core team believes that there is a lot of value in the entire toolkit being a unified project.

source: The L<Mojolicious> distribution includes a few files with different licenses that have been bundled for internal use.
ja: The [[Mojolicious]] distribution includes a few files with different licenses that have been bundled for internal use.

source: The L<Mojolicious|https://mojolicious.org> documentation is structured into three parts.
ja: The [[Mojolicious|https://mojolicious.org]] documentation is structured into three parts.

source: The L<Test::Mojo> WebSocket assertions serialize messages via event loop primitives.
ja: The [[Test::Mojo]] WebSocket assertions serialize messages via event loop primitives.

source: The L<Test::Mojo> object is I<stateful>.
ja: The [[Test::Mojo]] object is I<stateful]].

source: The L<Test::Mojo> object manages the Mojolicious application lifecycle (if a Mojolicious application class is supplied) as well as exposes the built-in L<Mojo::UserAgent> object.
ja: The [[Test::Mojo]] object manages the Mojolicious application lifecycle (if a Mojolicious application class is supplied) as well as exposes the built-in [[Mojo::UserAgent]] object.

source: The L<Test::More> module bundled with Perl includes several primitive test assertions, such as C<ok>, C<is>, C<isnt>, C<like>, C<unlike>, C<cmp_ok>, etc.
ja: The [[Test::More]] module bundled with Perl includes several primitive test assertions, such as C<ok>, C<is>, C<isnt>, C<like>, C<unlike>, C<cmp_ok>, etc.
